<template>
   <main class="main-content">
      <!-- Первый экран -->
      <section class="first-screen">
         <div class="first-screen-info">
            <h1 class="first-screen-title">
               <span class="highlight-section">Добро пожаловать на сайт</span><br />
               первой онлайн школы <br />
               домашнего пивоварения
            </h1>
            <a href="#section2" class="button transparent">Узнать больше</a>
         </div>
         <img class="first-screen-beer-image" src="../assets/images/banner-img.png" alt="Bottle of beer" />
      </section>

      <!-- Основное описание -->
      <section class="main-description" id="section2">
         <img class="brewing-beer-image" src="../assets/images/home.jpg" alt="Brewing process" />
         <p>
            <strong>Домашнее пивоварение</strong> – это увлекательное хобби, которое
            сочетает в себе творчество, науку и удовольствие от результата. <br /><br />
            Сегодня мы расскажем, почему стоит попробовать варить пиво дома и какие
            преимущества вы получите от этого замечательного процесса.
         </p>
      </section>

      <!-- Слайдер -->
      <section class="main-description-carousel section fade-section">
         <div class="subtitle subtitle_block_first">
            <h2>
               Почему стоит варить пиво дома:<br />
               <span class="highlight-section resons-margin-top">5 причин начать уже сегодня</span>
            </h2>
         </div>
         <div class="subtitle subtitle_block_second">
            <p>
               <b>Готовы сделать первый шаг?</b><br />
               Читайте о
               <router-link to="/about"><b> нашей школе </b></router-link> более подробно.<br />
               Присоединяйтесь к миру домашних пивоваров! 🍺
            </p>
         </div>

         <Swiper :modules="[Navigation, Pagination]" :navigation="true" :pagination="{ clickable: true }" :loop="true"
            class="mySwiper">
            <SwiperSlide v-for="(slide, index) in slides" :key="index">
               <h3><span class="highlight-section">{{ slide.title }}</span></h3>
               <div v-for="(paragraph, i) in slide.text" :key="i">
                  <p v-html="paragraph"></p>
               </div>
            </SwiperSlide>
         </Swiper>
      </section>

      <!-- Услуги школы -->
      <section class="about section fade-section">
         <header class="header" id="header">
            <router-link class="header-logo" to="/home">
               <img src="../assets/images/Logo-1.svg" class="header-logo-image" alt="Beer School Logo" />
            </router-link>
            <nav class="header-menu">
               <ul class="header-menu-list">
                  <li class="header-menu-item">
                     <a href="#main-page" class="header-menu-link" id="home">На верх <div class="arrow-top">↑
                        </div></a>
                  </li>
                  <li class="header-menu-item">
                     <router-link to="/articles" class="header-menu-link">Статьи</router-link>
                  </li>
                  <li class="header-menu-item">
                     <router-link to="/recipes" class="header-menu-link">Рецепты</router-link>
                  </li>
                  <li class="header-menu-item">
                     <router-link to="/about" class="header-menu-link">O школе</router-link>
                  </li>
               </ul>
            </nav>
            <div class="header-actions">
               <button @click="openHeaderModal" class="header-book-button button btn--show-modal-window" type="button"
                  title="Контакты">
                  Контакты
               </button>
            </div>
         </header>

         <div class="section__title">
            <h2 class="section__header">
               <span class="highlight-section">Услуги нашей школы</span>
            </h2>
         </div>

         <div class="operations">
            <div class="operations__tab-container">
               <button v-for="(title, index) in tabTitles" :key="index" @click="activeTab = index" :class="[
                  'operations__tab',
                  'btn-op',
                  `operations__tab--${index + 1}`,
                  activeTab === index ? 'operations__tab--active' : ''
               ]">
                  {{ title }}
               </button>
            </div>

            <div v-for="(content, index) in tabContents" :key="index"
               :class="['operations__content', activeTab === index ? 'operations__content--active' : '']">
               <h3 class="operations__header" v-html="content.header"></h3>
               <p v-if="content.text" v-html="content.text"></p>
               <ul v-if="content.list">
                  <li v-for="(item, i) in content.list" :key="i" v-html="item"></li>
               </ul>
               <p class="price" v-if="content.price">
                  <span class="highlight-section" v-html="content.price"></span>
               </p>
            </div>
         </div>


         <div class="section-footer">
            <p>
               Готовы начать?
               <strong @click="openHeaderModal" class="btn--show-modal-window">Свяжитесь с нами</strong> и сделайте
               первый шаг к
               созданию идеального пива!
            </p>
         </div>
      </section>
   </main>
</template>

<script setup>
import { ref } from 'vue';
import { defineProps } from 'vue'
import { onMounted } from 'vue'
import { Swiper, SwiperSlide } from 'swiper/vue';
import { Navigation, Pagination } from 'swiper/modules';

const props = defineProps({
   headerRef: Object
})

const openHeaderModal = () => {
   props.headerRef.openModal()
}

// CSS Swiper
import 'swiper/css';
import 'swiper/css/navigation';
import 'swiper/css/pagination';

// ---- Слайдер ----
const slides = [
   {
      title: '1. Контроль качества и вкуса',
      text: [
         'Когда вы варите пиво дома, вы полностью управляете ингредиентами. Отборное зерно, свежий хмель, чистая вода и качественные дрожжи – все это в ваших руках. Вы можете экспериментировать с рецептами и создавать напиток, идеально соответствующий вашим предпочтениям.<br><br>Любите насыщенный <strong>IPA</strong> с ярким ароматом цитрусов? Или предпочитаете мягкий стаут с нотками шоколада и кофе? Выбор за вами. Домашнее пивоварение позволяет вам забыть о компромиссах.'
      ],
   },
   {
      title: '2. Экономия средств',
      text: [
         'На первый взгляд кажется, что варить пиво дома дорого из-за оборудования и ингредиентов. Однако это инвестиция, которая окупается. Один раз купив оборудование, вы будете тратить только на сырье, а стоимость домашнего пива зачастую оказывается ниже магазинного, особенно премиальных сортов.<br><br><strong> Бонус:</strong > ваше пиво не будет обременено наценками, которые включают в себя транспортировку, упаковку и рекламу.'
      ],
   },
   {
      title: '3. Удовольствие от процесса',
      text: [
         'Варка пива – это одновременно наука и искусство. Вы узнаете основы химии, биологии и физики, что делает процесс не только увлекательным, но и познавательным.<br><br>Пивоварение – это еще и терапия: отмеряя ингредиенты, контролируя температуру, наблюдая за ферментацией, вы забываете о повседневных заботах. Этот процесс помогает расслабиться и по-настоящему насладиться результатом своей работы.'
      ],
   },
   {
      title: '4. Гордость за результат',
      text: [
         'Представьте, что вы предлагаете друзьям или близким бутылку пива, сделанного вашими руками. Они восхищаются вкусом, а вы с гордостью рассказываете о процессе. Домашнее пиво – это больше, чем напиток; это символ вашего труда, экспериментов и креативности.<br><br>Кроме того, ваше пиво можно сделать уникальным, добавив ингредиенты, которые редко встретишь в магазине: например, ягоды, специи или даже мед.'
      ],
   },
   {
      title: '5. Сообщество пивоваров',
      text: [
         'Домашние пивовары – это дружелюбное и увлеченное сообщество. Общение с такими же энтузиастами поможет вам расти и развиваться в этом увлекательном деле. На форумах, в социальных сетях и на мероприятиях по домашнему пивоварению вы найдете единомышленников, которые с радостью поделятся своими советами и секретами.<br><br>К тому же, это возможность обмениваться собственными рецептами, дегустировать пиво других и постоянно вдохновляться.'
      ],
   },
];

// ---- Табсы ----
const activeTab = ref(0);
const tabTitles = ['Полное обучение', 'Онлайн-консультации', 'Составление рецептов'];
const tabContents = [
   {
      header: '✅ Полное обучение с нуля (онлайн)',
      text: 'Идеально для тех, кто хочет освоить домашнее пивоварение с азов.',
      list: [
         'Разбор оборудования и подбор оптимального варианта.',
         'Изучение технологии пивоварения.',
         'Создание рецептов и сопровождение первой варки.',
      ],
      price: 'Стоимость: 20 000 рублей',
   },
   {
      header: '✅ Онлайн-консультация по сложным вопросам',
      text: 'Поможем решить любые трудности на вашем этапе.',
      list: ['Разбор конкретной ситуации.', 'Рекомендации по улучшению процесса.'],
      price: 'Стоимость: индивидуально',
   },
   {
      header: '✅ Составление индивидуальных рецептов',
      list: ['Рецепт под ваши предпочтения', 'При желании — сопровождение на всех этапах.'],
      price: 'от 3 000 рублей',
   },
];

// 👇 Intersection Observer
onMounted(() => {
   const fadeSections = document.querySelectorAll('.fade-section')

   const observer = new IntersectionObserver((entries) => {
      entries.forEach((entry) => {
         if (entry.isIntersecting) {
            entry.target.classList.add('visible')
         } else {
            entry.target.classList.remove('visible')
         }
      })
   }, { threshold: 0.2, rootMargin: '0px 0px -50px 0px' }
   )

   fadeSections.forEach(section => observer.observe(section))
})
</script>

<style scoped>
/* стили для анимации появления */
.fade-section {
   opacity: 0;
   transform: translateY(60px);
   transition: opacity 0.9s ease, transform 0.9s ease;
}

.fade-section.visible {
   opacity: 1;
   transform: translateY(0);
}
</style>