import equipmentImg from "../assets/images/equipment.webp";
import moltImg from "../assets/images/molt.webp";
import hopImg from "../assets/images/hop.webp";
import yeastImg from "../assets/images/yeast.webp";

export const articles = [
  {
    id: 1,
    title: "Выбор оборудования",
    image: equipmentImg,
    content: `<article>
         <section class= "highlight">
            <p><strong>Домашнее пивоварение</strong> — это увлекательное хобби, позволяющее создать собственное пиво с
               уникальным вкусом.
               Однако для того, чтобы начать, важно правильно выбрать оборудование. В этой статье мы разберем основные
               инструменты и устройства, которые помогут вам успешно сварить свое первое пиво.</p>
         </section >
         <h3>1. Что нужно для старта?</h3>
         <p>Для начинающего пивовара потребуется базовый набор оборудования. Его можно купить готовым комплектом или
            собрать самостоятельно.</p>
         <ul>
            <li><strong>Ферментер</strong> (емкость для брожения): пластиковый с крышкой и снабженный гидрозатвором или
               ЦКТ из нержавеющей стали.
            </li>
            <li><strong>Гидрозатвор</strong>: устройство для выпуска углекислого газа, предотвращающее попадание воздуха
               и бактерий в ферментер.</li>
            <li><strong>Котел для варки</strong> из нержавеющей стали или <strong>автоматическая пивоварня.</strong>
            </li>
            <li><strong>Сифон или кран</strong>: для переливания жидкости.</li>
            <li><strong>Термометр</strong>: для контроля температуры.</li>
            <li><strong>Стерилизатор</strong>: для обработки оборудования перед использованием.</li>
         </ul>

         <h3>2. Как выбрать котел для варки?</h3>
         <p>Котел — это сердце вашего пивоваренного процесса.</p>
         <ul>
            <li><strong>Материал</strong>: Нержавеющая сталь более долговечна и не влияет на вкус пива.</li>
            <li><strong>Объем</strong>: Лучше выбирать с запасом — если варите 10 литров пива, котел должен быть
               минимум 15 литров.</li>
            <li><strong>Наличие крана</strong>: Упрощает слив сусла после варки.</li>
         </ul>

         <h3>3. Ферментер: пластик или нержавеющая сталь?</h3>
         <p>Оба варианта подходят, но имеют свои особенности:</p>
         <ul>
            <li><strong>Пластиковый ферментер</strong>: Легкий, дешевый, но может царапаться, что увеличивает риск
               заражения.</li>
            <li><strong>Ферментер из нержавеющей стали</strong>: Устойчив к царапинам, долговечный, но тяжелый и
               дорогостоящий.</li>
         </ul>

         <h3>4. Дополнительное оборудование</h3>
         <p>Хотя базовый набор подойдет для начала, некоторые инструменты улучшат качество вашего пива:</p>
         <ul>
            <li><strong>Ареометр или рефрактометр</strong>: Для измерения плотности сусла.</li>
            <li><strong>Суслоохладитель</strong>: Ускоряет охлаждение после варки.</li>
            <li><strong>Бутылочный наполнитель</strong>: Упрощает процесс розлива пива.</li>
         </ul>

         <h3>5. Где покупать оборудование?</h3>
         <p>Вот несколько вариантов:</p>
         <ul>
            <li><strong>Специализированные магазины</strong>: Готовые наборы и консультации.</li>
            <li><strong>Интернет-магазины</strong>: Большой выбор и удобная доставка.</li>
            <li><strong>Б/У оборудование</strong>: Экономичный вариант, но проверяйте качество.</li>
         </ul>

         <h3>6. Сколько это стоит?</h3>
         <p>Цены варьируются очень сильно, все зависит от ваших потребностей и возможностей. На консультации мы поможем
            подобрать наилучший вариант под ваши цели и задачи.</p>
         <section class="highlight">
            <h3>Советы для начинающих</h3>
            <ul>
               <li>Начинайте с простых рецептов.</li>
               <li>Следите за чистотой оборудования.</li>
               <li>Экспериментируйте, но соблюдайте основные правила.</li>
            </ul>
         </section>
         <p>Выбор оборудования для домашнего пивоварения — это первый шаг на пути к созданию вашего уникального пива.
            Если вы подойдете к этому процессу ответственно, уже через несколько недель сможете наслаждаться вкусом
            собственного напитка.</p>

         <p><strong>А вы уже начали свое пивоваренное приключение? Делитесь опытом и задавайте нам свои
               вопросы!</strong></p>
      </article > `,
  },
  {
    id: 2,
    title: "Солод в пивоварении",
    image: moltImg,
    content: `<article>
            <h2>Солод: Основа вкуса в домашнем пивоварении</h2>
            <p class="highlight"><strong>Солод — это сердце любого пивного рецепта.</strong> Этот ингредиент не только определяет цвет и
               вкус пива, но и
               обеспечивает сахар, необходимый для ферментации. В этой статье мы расскажем, что такое солод, как его
               выбирать и использовать в домашнем пивоварении.</p>

            <section>
               <h2>Что такое солод?</h2>
               <p>Солод получают из зёрен, чаще всего ячменя, путём их проращивания и сушки. Этот процесс активирует
                  ферменты, которые впоследствии помогают преобразовывать крахмал в сахара. Существует множество видов
                  солода, и каждый из них придаёт пиву уникальные свойства.</p>
            </section>

            <section>
               <h2>Основные типы солода</h2>

               <h3>1. Базовый солод</h3>
               <p>Этот вид солода используется в качестве основы большинства рецептов. Примеры — пилснерский, светлый
                  ячменный и мюнхенский солода. Он содержит много ферментов, которые необходимы для затирания.</p>

               <h3>2. Специальный солод</h3>
               <p>Добавляется для придания пиву особых характеристик: цвета, вкуса или аромата. Сюда относятся:</p>
               <ul>
                  <li>Карамельный солод — для сладости и карамельных оттенков.</li>
                  <li>Жжёный солод — для тёмного цвета и кофейных нот.</li>
                  <li>Пшеничный солод — для улучшения пены.</li>
               </ul>

               <h3>3. Неполный солод</h3>
               <p>Используется для создания определённых стилей пива, таких как лагеры. Этот солод содержит меньше
                  ферментов, чем базовый.</p>
            </section>

            <section>
               <h2>Как выбрать солод для своего пива?</h2>

               <p>При выборе солода важно учитывать стиль пива, который вы хотите сварить. Например, светлый пилснер
                  потребует базового солода, в то время как для стаута понадобится комбинация базового и жжёного
                  солодов.</p>
            </section>

            <section>
               <h2>Советы по хранению солода</h2>
               <p>Для сохранения качества солода храните его в сухом, прохладном и тёмном месте. Используйте герметичные
                  контейнеры, чтобы избежать попадания влаги и насекомых.</p>
            </section>

            <section class="highlight">
               <p><strong>Солод — это не только основа пивоварения, но и источник вдохновения для создания уникальных
                     рецептов.
                     Экспериментируйте с различными видами солода, чтобы достичь идеального вкуса!</strong></p>
            </section>
</article>`,
  },
  {
    id: 3,
    title: "Хмель в пивоварении",
    image: hopImg,
    content: `<article>
         <h2>Хмель в пивоварении: душа вкуса и аромата</h2>

         <p class="highlight">Хмель &mdash; это одна из ключевых составляющих пивоварения, которая придает пиву его
            характерный вкус,
            аромат и баланс. Этот удивительный ингредиент используется пивоварами на протяжении веков и остается
            незаменимым элементом для создания уникальных сортов напитка.</p>

         <h2>История использования хмеля</h2>
         <p>Хмель начали использовать в пивоварении в Европе в раннем Средневековье. До этого для придания пиву аромата
            применялись различные травы и специи. Первые упоминания о хмеле датируются IX веком, а в XII веке его
            использование стало повсеместным. Хмель не только улучшал вкус, но и действовал как натуральный консервант,
            помогая пиву дольше сохранять свежесть.</p>

         <h2>Зачем нужен хмель в пиве?</h2>
         <ul>
            <li><strong>Баланс вкуса.</strong> Хмель добавляет пиву горечь, которая уравновешивает сладость солода.</li>
            <li><strong>Аромат.</strong> В зависимости от сорта хмеля, пиво может иметь цветочные, фруктовые,
               цитрусовые, пряные или даже хвойные нотки.</li>
            <li><strong>Консервация.</strong> Хмель обладает антимикробными свойствами, что помогает защищать пиво от
               нежелательных бактерий.</li>
            <li><strong>Стабильность пены.</strong> Стабильная и плотная пена &mdash; это тоже заслуга хмеля.</li>
         </ul>

         <h2>Виды хмеля и их роль</h2>
         <p>Существует множество сортов хмеля, каждый из которых используется для различных целей:</p>
         <ul>
            <li><strong>Горькие сорта.</strong> С высоким содержанием альфа-кислот, такие хмели используются для
               придания пиву характерной горечи. Примеры: Chinook, Magnum.</li>
            <li><strong>Ароматические сорта.</strong> Они отвечают за уникальный аромат. Примеры: Cascade, Saaz.</li>
            <li><strong>Дуальные сорта.</strong> Эти хмели подходят как для горечи, так и для аромата. Примеры:
               Centennial, Simcoe.</li>
         </ul>

         <h2>Как хмель влияет на стиль пива</h2>
         <p>Хмель &mdash; это основа стилей, таких как IPA (India Pale Ale), где он выступает на первом плане, или
            Pilsner, где горечь и аромат более сбалансированы. Например, американские IPA славятся яркими цитрусовыми и
            хвойными нотами, благодаря таким сортам хмеля, как Citra и Amarillo. Европейские лагеры, в свою очередь,
            используют благородные сорта хмеля, такие как Hallertau, для мягкого и изысканного вкуса.</p>

         <h2>Добавление хмеля в процессе варки</h2>
         <p>Хмель может добавляться на разных этапах пивоварения:</p>
         <ul>
            <li><strong>В начале кипячения.</strong> Для создания горечи.</li>
            <li><strong>В середине.</strong> Для сочетания горечи и аромата.</li>
            <li><strong>В конце или при сухом охмелении.</strong> Для сохранения яркого аромата.</li>
         </ul>
         <section class="highlight">
            <h2>Советы для домашних пивоваров</h2>
            <ul>
               <li>Экспериментируйте с сортами хмеля, чтобы найти уникальные сочетания.</li>
               <li>Используйте сухое охмеление для усиления аромата.</li>
               <li>Обратите внимание на свежесть хмеля &mdash; храните его в холодильнике в вакуумной упаковке.</li>
            </ul>
         </section>
         <p>Хмель &mdash; это не просто ингредиент, а настоящая душа пива. Он позволяет создавать бесконечное
            разнообразие стилей и вкусов. Изучение хмеля &mdash; это путь к глубокому пониманию пивоварения и
            созданию
            настоящих шедевров.</p>

         <p>Готовы ли вы исследовать мир хмеля? Начните уже сегодня и откройте для себя безграничные возможности этого
            удивительного растения!</p>

      </article>`,
  },
  {
    id: 4,
    title: "Дрожжи для пива",
    image: yeastImg,
    content: `<article>
         <h2>Дрожжи в пивоварении: невидимые мастера вкуса</h2>

         <p class="highlight">Дрожжи &mdash; это микроорганизмы, которые играют ключевую роль в процессе пивоварения.
            Они не только
            превращают сахар в алкоголь, но и создают богатство вкусов и ароматов, которые мы ассоциируем с разными
            стилями
            пива.</p>

         <h2>Что такое дрожжи?</h2>
         <p>Дрожжи &mdash; это одноклеточные грибы, принадлежащие к роду Saccharomyces. В пивоварении чаще всего
            используются два вида:</p>
         <ul>
            <li><strong>Saccharomyces cerevisiae.</strong> "Верховые" дрожжи, которые ферментируют при более высоких
               температурах и используются для производства элей.</li>
            <li><strong>Saccharomyces pastorianus.</strong> "Низовые" дрожжи, работающие при низких температурах и
               идеально
               подходящие для лагеров.</li>
         </ul>

         <h2>Роль дрожжей в пивоварении</h2>
         <ol>
            <li><strong>Ферментация.</strong> Дрожжи преобразуют сахара, содержащиеся в сусле, в алкоголь и углекислый
               газ.
               Это основной процесс, благодаря которому пиво становится алкоголесодержащим напитком.</li>
            <li><strong>Вкусы и ароматы.</strong> Различные штаммы дрожжей могут производить сложные эфиры, фенолы и
               другие
               соединения, которые придают пиву фруктовые, пряные или другие специфические нотки.</li>
            <li><strong>Карбонизация.</strong> В процессе ферментации дрожжи выделяют углекислый газ, который насыщает
               пиво
               природной карбонизацией.</li>
         </ol>

         <h2>Типы дрожжей и их использование</h2>
         <ul>
            <li><strong>Элевые дрожжи.</strong> Работают при температурах 15-24&deg;C. Они создают сложные ароматы,
               часто с
               нотами фруктов или специй. Используются для элей, стаутов, IPA.</li>
            <li><strong>Лагерные дрожжи.</strong> Действуют при 7-13&deg;C и дают чистый, нейтральный вкус. Используются
               для лагеров, пилзнеров, боков.</li>
            <li><strong>Дикие дрожжи.</strong> Такие, как Brettanomyces, придают пиву кислинку и уникальные "дикарские"
               оттенки. Применяются в ламбиках, гёзах и других специализированных стилях.</li>
         </ul>

         <h2>Как дрожжи влияют на стиль пива</h2>
         <p>Выбор дрожжей &mdash; это один из самых важных аспектов при создании пива. Например:</p>
         <ul>
            <li><strong>Вайцен.</strong> Для этого стиля используются дрожжи, которые дают банановые и гвоздичные нотки.
            </li>
            <li><strong>Бельгийские эли.</strong> Здесь дрожжи создают сложные ароматы с оттенками специй и фруктов.
            </li>
            <li><strong>Американские IPA.</strong> Нейтральные дрожжи позволяют раскрыться ароматам хмеля.</li>
         </ul>
         <section class="highlight">
            <h2>Советы для домашних пивоваров</h2>
            <ul>
               <li>Выбирайте дрожжи в зависимости от стиля пива, который вы хотите сварить.</li>
               <li>Убедитесь, что дрожжи свежие и активные. Используйте стартер для их активации.</li>
               <li>Поддерживайте оптимальную температуру ферментации, чтобы избежать нежелательных ароматов.</li>
               <li>Дайте дрожжам время завершить работу. Не спешите с розливом.</li>
            </ul>
         </section>
         <h2>Инновации и эксперименты</h2>
         <p>Современные пивовары активно экспериментируют с разными штаммами дрожжей. Использование крио-дрожжей,
            гибридных
            штаммов и даже дрожжей, выделенных из старинных бутылок пива, открывает новые горизонты для творчества.</p>

         <p>Дрожжи &mdash; это настоящие невидимые мастера, без которых пивоварение невозможно. Они превращают простое
            сусло в изысканный напиток, полный жизни и вкуса. Знание о дрожжах поможет вам создавать пиво, которое будет
            восхищать и вдохновлять.</p>
      </article>`,
  },
];
